In [6]:
data= [
    {"key":"1", "tt":"1"},
    {"key":"2", "tt":"1"},
    {"key":"3", "tt":"1"},
    {"key":"4", "tt":"1"},
]
import pandas as pd
t = pd.DataFrame(data)

In [7]:
t

  key tt
0   1  1
1   2  1
2   3  1
3   4  1

In [8]:
t.loc[0:1]

  key tt
0   1  1
1   2  1

In [14]:
t.iloc[0:2, 1:2]

  tt
0  1
1  1